{
"suggest":{"institute":["National Institute of Technology , Agartala (Tripura)",
 "Motilal Nehru National Institute of Technology, Allahabad (UP)",
 "National Institute of Technology, Arunachal Pradesh",
 "Maulana Azad National Institute of Technology, Bhopal (MP)",
 "National Institute of Technology, Calicut (Kerela)",
 "National Institute of Technology, Delhi",
 "National Institute of Technology, Durgapur (West Bengal)",
 "National Institute of Technology, Goa",
 "National Institute of Technology, Hamirpur (Himachal Pradesh)",
 "Malviya National Institute of Technology, Jaipur (Rajasthan)",
 "Dr B R Ambedkar National Institute of Technology, Jalandhar (Punjab)",
 "National Institute of Technology, Jamshedpur (Jharkhand)",
 "National Institute of Technology, Kurukshetra (Haryana)",
 "National Institute of Technology, Manipur",
 "National Institute of Technology, Meghalaya",
 "National Institute of Technology, Mizoram",
 "National Institute of Technology, Nagaland",
 "Visvesvaraya National Institute of Technology, Nagpur (Maharashtra)",
 "National Institute of Technology, Patna (Bihar)",
 "National Institute of Technology, Puducherry",
 "National Institute of Technology, Raipur (Chhattisgarh)",
 "National Institute of Technology, Rourkela (Odisha)",
 "National Institute of Technology, Sikkim",
 "National Institute of Technology, Silchar (Assam)",
 "National Institute of Technology, Hazartbal, Srinagar (J & K)",
 "Sardar Vallabhbhai National Institute of Technology, Surat (Gujarat)",
 "National Institute of Technology, Surathkal, Mangalore (Karnataka)",
 "National Institute of Technology, Tiruchirapalli (Tamil Nadu)",
 "National Institute of Technology, Uttrakhand",
 "National Institute of Technology, Warangal",
 "National Institute of Technology, Andhra Pradesh, Vatluru, Eluru",
"Atal Bihari Vajpayee Indian Institute of Information Technology & Management, Gwalior (MP)",
 "Indian Institute of Information Technology, Design & Manufacturing, Kanchipuram, Chennai (Tamil Nadu)",
"Indian Institute of Information Technology, Jhalwa, Allahabad (UP)",
"Pandit Dwarka Prasad Mishra Indian Institute of Information Technology, Design & Manufacturing,Jabalpur (MP)",
 "Indian Institute of Information Technology, Guwahati (Assam)",
 "Indian Institute of Information Technology, Kota (Rajasthan)",
 "Indian Institute of Information Technology, Sri City, Chitoor (A P)",
"Indian Institute of Information Technology, Vadodara (Gujarat)",
 "Indian Institute of Information Technology Manipur Mantripukhri, Imphal ",
 "Indian Institute of Information Technology Srirangam,Tiruchirappalli",
 "Indian Institute of Information Technology Lucknow",
 "Indian Institute of Information Technology(IIIT) Dharwad",
 "Indian Institute of Information Technology(IIIT) Kurnool",
 "Indian Institute of Information Technology(IIIT) Kottayam",
 "Indian Institute of Information Technology(IIIT) Kalyani, West Bengal",
 "Indian Institute of Information Technology(IIIT) Kilohrad, Sonepat, Haryana",
 "Indian Institute of Information Technology(IIIT) Una, Himachal Pradesh",
 "Indian Institute of Information Technology (IIIT) Ranchi, Jharkhand",
 "Indian Institute of Information Technology (IIIT) Nagpur, Maharashtra",
 "Indian Institute of Information Technology (IIIT) Pune , Maharshtra",
 "Indian Institute of Information Technology Bhagalpur",
 "Indian Institute of Information Technology Bhopal",
 "Indian Institute of Information Technology Surat",
"Assam University, Silchar (Assam)",
 "Birla Institute of Technology, Mesra, Ranchi (Jharkhand)",
 "Gurukul Kangri Vishwavidyalaya, Haridwar (Uttarakhand)",
 "Indian Institute of Carpet Technology, Bhadohi (UP)",
 "Institute of Infrastructure, Technology, Research & Management, Ahmedabad",
 "Institute of Technology, Guru Ghasidas Vishawavidyalaya, Bilaspur (CG)",
 "JK Institute of Applied Physics & Technology, University of Allahabad, Allahabad-  (UP)",
 "Mizoram University, Aizwal",
 "National Institute of Foundry& Forge Technology, PO Hatia Ranchi (Jharkhand)",
 "School of Planning and Architecture, Bhopal (Madhya Pradesh)",
 "School of Planning and Architecture, IP Estate, New Delhi (SPA, Delhi)",
 "School of Planning and Architecture, Vijayawada (Andhra Pradesh)",
 "Shri Mata Vaishno Devi University, Katra- (J & K)",
 "Tezpur University, NAPAAM, Tezpur (Assam)",
 "Indian Institute of Engineering Science & Technology, Shibpur",
 "Indian Institute of Crop Processing Technology, Thanjavur, Tamilnadu",
 "National Institute of Electronics and Information Technology, Aurangabad, Maharashtra",
"Sant Longowal Institute of Engineering and Technology Longowal – , Distt Sangrur (Pb), India",
 "Harcourt Butler Technical University, Kanpur (UP)",
 "Indian Institute of Petroleum & Energy, Visakhapatnam",
 "Indian Institute of Handloom Technology, Salem, Tamil Nadu",
 "Jamia Hamdard University, Delhi",
 "University of Hyderabad, Hyderabad",
"Punjab Technical University, Jalandhar",
 "Punjab Engineering College, Chandigarh",
 "Indian Institute of Science, Banglore",
 "Indian Institute of Space Technology, Thiruvanathapuram",
 "Indraprastha Institute of Information Technology, Delhi",
 "Delhi Technological University, New Delhi",
 "Indira Gandhi Delhi Technical University for Women, New Delhi",
 "Netaji Subhash Institute of Technology (under Delhi University)",
 "Jamia Millia Islamia, New Delhi",
"AISECT UNIVERSITY, BHOPAL, MADHYA PRADESH",
 "AMITY SCHOOL OF ENGINEERING, AMITY UNIVERSITY HARYANA, GURGAON, HARYANA",
 "AMITY SCHOOL OF ENGINEERING, AMITY UNIVERSITY MADHYA PRADESH, GWALIOR, MADHYA PRADESH",
 "AMITY SCHOOL OF ENGINEERING, AMITY UNIVERSITY MUMBAI, MAHARASHTRA",
 "AMITY SCHOOL OF ENGINEERING, AMITY UNIVERSITY RAJASTHAN, JAIPUR, RAJASTHAN",
 "AMITY SCHOOL OF ENGINEERING, AMITY UNIVERSITY UTTAR PRADESH, LUCKNOW, UTTAR PRADESH",
 "AMITY SCHOOL OF ENGINEERING, AMITY UNIVERSITY UTTAR PRADESH, NOIDA, UTTAR PRADESH",
 "AMITY SCHOOL OF ENGINEERING, AMITY UNIVERSITY WEST BENGAL, KOLKATA, WEST BENGAL",
 "AMITY SCHOOL OF ENGINEERING, GREATER NOIDA, UTTAR PRADESH",
 "AMITY SCHOOL OF ENGINEERING, RAIPUR, CHHATTISGARH",
 "BHAGWANT UNIVERSITY,SIKAR ROAD,AJMER, RAJASTHAN",
 "Dr MGR EDUCATIONAL AND RESEARCH INSTITUTE, CHENNAI, TAMIL NADU",
 "DR KN MODI UNIVERSITY, TONK, RAJASTHAN",
 "GALGOTIAS UNIVERSITY UTTAR PRADESH, GREATER NOIDA, UTTAR PRADESH",
 "ITM UNIVERSITY GWALIOR, MADYA PRADESH",
 "KALASALINGAM ACADEMY OF RESEARCH AND EDUCATION, ANAND NAGAR, KRISHNANKOIL, (TN)",
 "NOIDA INTERNATIONAL UNIVERSITY, GAUTAM BUDH NAGAR, UTTAR PRADESH",
"PERIYAR MANIAMMAI INSTITUTE OF SCIENCE AND TECHNOLOGY, VALLAM THANJAVUR, TAMIL NADU",
 "TECHNO INDIA UNIVERSITY, KOLKATA, WEST BENGAL (RESIDENTIAL) "
 ],
 "course":[ "Agricultural and Food Engineering (4 Years, Bachelor of Technology)",
"Biological Sciences and Bioengineering (4 Years, Bachelor of Technology)",
"Bio Technology (4 Years, Bachelor of Technology)",
"Biotechnology and Biochemical Engineering (4 Years, Bachelor of Technology)",
"Ceramic Engineering (4 Years, Bachelor of Technology)",
"Chemical Engineering (4 Years, Bachelor of Technology)",
"Chemical Science and Technology (4 Years, Bachelor of Technology)",
"Civil Engineering (4 Years, Bachelor of Technology)",
"Computer Science and Engineering (4 Years, Bachelor of Technology)",
"Electrical Engineering (4 Years, Bachelor of Technology)",
"Electrical Engineering (Power and Automation) (4 Years, Bachelor of Technology)",
"Electronics Engineering (4 Years, Bachelor of Technology)",
"Electronics and Communication Engineering (4 Years, Bachelor of Technology)",
 "Electronics and Electrical Communication Engineering (4 Years, Bachelor of Technology)",
"Electronics and Electrical Engineering (4 Years, Bachelor of Technology)",
"Engineering Physics (4 Years, Bachelor of Technology)",
"Engineering Science (4 Years, Bachelor of Technology)",
"Environmental Engineering (4 Years, Bachelor of Technology)",
"Instrumentation Engineering (4 Years, Bachelor of Technology)",
"Manufacturing Science and Engineering (4 Years, Bachelor of Technology)",
"Materials Science and Engineering (4 Years, Bachelor of Technology)",
"Mathematics and Computing (4 Years, Bachelor of Technology)",
"Mechanical Engineering (4 Years, Bachelor of Technology)",
"Metallurgical Engineering (4 Years, Bachelor of Technology)",
"Metallurgical and Materials Engineering (4 Years, Bachelor of Technology)",
"Metallurgical Engineering and Materials Science (4 Years, Bachelor of Technology)",
"Mineral Engineering (4 Years, Bachelor of Technology)",
"Mining Engineering (4 Years, Bachelor of Technology)",
"Mining Machinery Engineering (4 Years, Bachelor of Technology)",
"Naval Architecture and Ocean Engineering (4 Years, Bachelor of Technology)",
"Ocean Engineering and Naval Architecture (4 Years, Bachelor of Technology)",
"Petroleum Engineering (4 Years, Bachelor of Technology)",
"Polymer Science and Engineering (4 Years, Bachelor of Technology)",
"Production and Industrial Engineering (4 Years, Bachelor of Technology)",
"Electronics System Engineering (4 Years, Bachelor of Technology)",
"Textile Technology (4 Years, Bachelor of Technology)",
"Electronics and Instrumentation Engineering (4 Years, Bachelor of Technology)",
"Bio Engineering (4 Years, Bachelor of Technology)",
"Electrical and Electronics Engineering (4 Years, Bachelor of Technology)",
"Production Engineering (4 Years, Bachelor of Technology)",
"Information Technology (4 Years, Bachelor of Technology)",
"Instrumentation and Control Engineering (4 Years, Bachelor of Technology)",
"Industrial and Production Engineering (4 Years, Bachelor of Technology)",
"Computer Engineering (4 Years, Bachelor of Technology)",
"Bio Medical Engineering (4 Years, Bachelor of Technology)",
"Electronics and Telecommunication Engineering (4 Years, Bachelor of Technology)",
"Food Processing Engineering (4 Years, Bachelor of Technology)",
"Industrial Design (4 Years, Bachelor of Technology)",
"Metallurgy and Materials Engineering (4 Years, Bachelor of Technology)",
"Electronics Engineering - Design and Manufacturing (4 Years, Bachelor of Technology)",
"Mechanical Engineering- Design and Manufacturing (4 Years, Bachelor of Technology)",
"Chemical Engineering (Plastic and Polymer) (4 Years, Bachelor of Technology)",
"Carpet and Textile Technology (4 Years, Bachelor of Technology)",
"Materials Science and Metallurgical Engineering (4 Years, Bachelor of Technology)",
"Manufacturing Engineering (4 Years, Bachelor of Technology)",
"Food Technology (4 Years, Bachelor of Technology)",
"Mechanical Engineering (Manuacturing Engineering) (4 Years, Bachelor of Technology)",
"Mechanical Engineering (Welding Technology) (4 Years, Bachelor of Technology)",
"Food Engineering and Technology (4 Years, Bachelor of Technology)",
"Agricultural Engineering (4 Years, Bachelor of Technology)",
"Food Process Engineering (4 Years, Bachelor of Technology)",
"Industrial and Systems Engineering (4 Years, Bachelor of Technology)",
"Chemistry (4 Years, Bachelor of Science)",
"Economics (4 Years, Bachelor of Science)",
"Mathematics and Scientific Computing (4 Years, Bachelor of Science)",
"Physics (4 Years, Bachelor of Science)",
"Pharmaceutics (4 Years, Bachelor of Pharmaceutics)",
"Design (4 Years, Bachelor of Design)",
"Planning (4 Years, Bachelor of Planning)",
"Architecture (5 Years, Bachelor of Architecture)",
"Architecture, Town and Regional Planning (5 Years, Bachelor of Architecture)",
"Aerospace Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Agricultural and Food Engineering with M.Tech. in any of the listed specializations (5 Years,Bachelor and Master of Technology (Dual Degree))",
"Biochemical Engineering with M.Tech. in Biochemical Engineering and Biotechnology (5 Years,Bachelor and Master of Technology (Dual Degree))",
"Biochemical Engineering and Biotechnology (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Bioengineering with M.Tech in Biomedical Technology (5 Years, Bachelor and Master of Technology(Dual Degree))",
"Biological Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Biotechnology and Biochemical Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Ceramic Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Chemical Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Electronics and Telecommunication Engineering (5 Years, Bachelor and Master of Technology(Dual Degree))",
"Civil Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Civil Engineering with M.Tech. in Structural Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Civil Engineering with any of the listed specialization (5 Years, Bachelor and Master of Technology(Dual Degree))",
"Computer Science and Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Electrical Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Electrical Engineering with M.Tech. in Communications and Signal Processing (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Computer Science and Technology (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Electrical Engineering with M.Tech. in Microelectronics (5 Years, Bachelor and Master of Technology(Dual Degree))",
"Electrical Engineering with M.Tech. in any of the listed specializations (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Electrical Engineering with M.Tech. in Power Electronics (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Electronics and Communication Engineering and M.Tech. Bio-Medical Engineering (5 Years,Bachelor and Master of Technology (Dual Degree))",
"Electronics and Electrical Communication Engineering with M.Tech. in any of the listed specializations (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Energy Engineering with M.Tech. in Energy Systems Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Engineering Design (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Engineering Physics and M.Tech. with specialization in Nano Science (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Materials Science and Technology (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Mechanical Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Electronics and Communication Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Mechanical Engineering and M.Tech. in Computer Integrated Manufacturing (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Mechanical Engineering with M.Tech. in any of the listed specializations (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Metallurgical Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Industrial and Systems Engineering with M.Tech. in Industrial and Systems Engineering)",
"Management (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Metallurgy and Materials Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Metallurgical and Materials Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Metallurgical Engineering and Materials Science with M.Tech. in Ceramics and Composites (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Metallurgical Engineering and Materials Science with M.Tech. in Metallurgical Process Engineering(5 Years, Bachelor and Master of Technology (Dual Degree))",
"Mineral Engineering with M.Tech in Mineral Engineering (5 Years, Bachelor and Master of Technology)",
"Mining Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Mechanical Engineering (D and M) and M.Tech (Product Design) (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Quality Engineering Design and Manufacturing (5 Years, Bachelor and Master of Technology)",
"Mathematics and Computing (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Electrical Engineering and M.Tech Power Electronics and Drives (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Computer Science and Engineering and M.Tech Computer Science (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Chemical Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Ceramic Engineering and M.Tech Industrial Ceramic (5 Years, Bachelor and Master of Technology(Dual Degree))",
"Civil Engineering and M.Tech in Water Resources (5 Years, Bachelor and Master of Technology(Dual Degree))",
"Civil Engineering and M.Tech in Transportation Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Computer Science and Engineering and M.Tech in Information Security (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Electronics and Communication Engineering and M.Tech Communication and Network (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Electronics and Instrumentation Engineering and M.Tech VLSI Design and Embedded (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Electrical Engineering and M.Tech Electronic Systems and Communications (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Mechanical Engineering and M.Tech Mechatronics and Automation (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Engineering Physics (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Mechanical Engineering (D and M) and M.Tech (Advanced Manufacturing) (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Electronics Engineering (D and M) and M.Tech VLSI and Electronics System Design (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Electronics Engineering (D and M) and M.Tech Signal Processing and Communication System )",
"Design (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Computer Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Infromation Technology and M.Tech (Information Technology) Spl. Wireless Communication Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Infromation Technology and M.Tech (Information Technology) Spl. Software Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Infromation Technology and M.Tech (Information Technology) Spl. Robotics (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Infromation Technology and M.Tech (Information Technology) Spl. (Intellegent System) (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Infromation Technology and M.Tech (Information Technology) Spl. (Human Computer Interaction)(5 Years, Bachelor and Master of Technology (Dual Degree))",
"Infromation Technology and M.Tech (Information Technology) Spl. (Cyber Law and Information SecurInformation Technologyy) (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Infromation Technology and M.Tech (Information Technology) Spl. Bio-Informatics (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Electronics and Communication Engineering and M.Tech (ECE) Spl. (Micro Electronics) (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Information Technology (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Management (5 Years, Bachelor and Master of Technology (Dual Degree))",
"Engineering Physics (5 Years, Integrated Master of Technology)",
"Geological Technology (5 Years, Integrated Master of Technology)",
"Geophysical Technology (5 Years, Integrated Master of Technology)",
"Industrial Chemistry (5 Years, Integrated Master of Technology)",
"Mathematics and Computing (5 Years, Integrated Master of Technology)",
"Applied Geology (5 Years, Integrated Master of Technology)",
"Applied Geophysics (5 Years, Integrated Master of Technology)",
"Electronics and Communication Engineering and MBA (Information Technology) (5 Years, Bachelor of Technology and MBA (Dual Degree))",
"Infromation Technology and MBA (Information Technology) (5 Years, Bachelor of Technology and MBA (Dual Degree))",
"Applied Geology (5 Years, Integrated Master of Science)",
"Applied Mathematics (5 Years, Integrated Master of Science)",
"Chemistry (5 Years, Integrated Master of Science)",
"Economics (5 Years, Integrated Master of Science)",
"Exploration Geophysics (5 Years, Integrated Master of Science)",
"Mathematics and Computing (5 Years, Integrated Master of Science)",
"Physics (5 Years, Integrated Master of Science)",
"Mathematics (5 Years, Integrated Master of Science)",
"Life Science (5 Years, Integrated Master of Science)",
"Biological Sciences (5 Years, Bachelor of Science and Master of Science (Dual Degree))",
"Physics (5 Years, Bachelor of Science and Master of Science (Dual Degree))",
"Chemistry (5 Years, Bachelor of Science and Master of Science (Dual Degree))",
"Mathematics (5 Years, Bachelor of Science and Master of Science (Dual Degree))",
"Pharmaceutics (5 Years, Bachelor and Master of Pharmaceutics(Dual Degree))",
"B.Tech (Information Technology) and MBA /M.Tech (Information Technology) (5 Years, Integrated B. Tech. and M. Tech. /MBA)"
 ]
 }
}